// формула лепестка  ρ = a · cos(k · φ) 

// Параметр a определяет размер: вся кривая будет лежать внутри круга радиуса a. 

// Параметр k задаёт количество лепестков и их форму:

// Если k — целое число: при нечётном k получится k лепестков, при чётном — 2k лепестков. 

// Если k — рациональное число (можно записать как дробь m/n), количество лепестков тоже будет зависеть от m и n: при нечётных m и n — m лепестков 
//(они могут частично перекрываться), при чётном m или чётном n — 2m лепестков (тоже с перекрытием). 

// Если k — иррациональное число, роза превратится в ажурную, бесконечно развивающуюся структуру с бесконечным множеством частично перекрывающихся лепестков. 




class model {
    public:

};